# Taps
tap "homebrew/bundle"

# ─── CLI Tools ────────────────────────────────────────────
brew "git"
brew "gh"                   # GitHub CLI
brew "jq"                   # JSON processor
brew "fnm"                  # Fast Node Manager
brew "pyenv"                # Python version manager
brew "yarn"
brew "gettext"
brew "kubectx"              # Kubernetes context/namespace switcher
brew "kubectl"
brew "fzf"                  # Fuzzy finder - used by many AI tools and shell workflows
brew "ripgrep"              # Fast search - used by editors and AI tools
brew "bat"                  # Better cat with syntax highlighting
brew "eza"                  # Modern ls replacement
brew "starship"             # Cross-shell prompt
brew "awscli"               # AWS CLI

# ─── AI & Dev Tools ──────────────────────────────────────
cask "claude"               # Claude desktop app
cask "cursor"               # AI-first code editor
cask "visual-studio-code"   # VS Code
cask "ghostty"              # Modern GPU-accelerated terminal
cask "docker"
cask "httpie"               # HTTP client

# ─── Fonts ────────────────────────────────────────────────
cask "font-hack-nerd-font"

# ─── Productivity ─────────────────────────────────────────
cask "raycast"              # Launcher (replaces Spotlight)
cask "maccy"                # Clipboard manager
cask "rectangle"            # Window management
cask "notion-calendar"      # Calendar app (formerly Cron)

# ─── Browsers ────────────────────────────────────────────
cask "google-chrome"

# ─── Communication ───────────────────────────────────────
cask "slack"
cask "discord"
cask "whatsapp"
cask "telegram"
cask "zoom"

# ─── Media ───────────────────────────────────────────────
cask "vlc"
